Tekla Open API Reference for Tekla Structures 2025
Mesh.AddPoint Method
 Adds a new point in the mesh.
 Namespace: Tekla.Structures.Model.UI
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public int AddPoint(
	Point Point
)
Public Function AddPoint (
	Point As Point
) As Integer
Parameters
Point
Type: Tekla.Structures.Geometry3d.Point
The point to be added, must not be null.
Return Value
Type: Int32
The index of the added point.
See Also
Reference
Mesh Class
Tekla.Structures.Model.UI Namespace